import "./Policy.scss";

import { Link } from "react-router-dom";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { faAngleDoubleRight } from "@fortawesome/free-solid-svg-icons";

const Policy = () => {
  return (
    <>
      <div className="policy-wrapper">
        <div className="policy-inner b-width">
          <div className="path-link">
            <Link className="path-link-home" to={"/"}>Trang chủ</Link>
            <FontAwesomeIcon className="path-icon" icon={faAngleDoubleRight} />
            <span className="path-current">Chính sách</span>
          </div>
          <div className="policy-content">
            <div className="policy-title">
                <div className="title">Chính sách MERON FARM</div>
                <div className="sub-title">Khách hàng, Nhà cung cấp, Cửa hàng, Đại sứ bán hàng khi tham gia vào MERON FARM sẽ<br/>tuân theo các chính sách và quy định</div>
            </div>
            <div className="policy-list">
                <div className="policy-item">
                    <div className="policy-item__inner">
                        <svg width={64} height={64} viewBox="0 0 512 512" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill="rgb(239, 103, 15)" d="M360.8 110.208C360.288 98.944 360.288 88.192 360.288 77.44C360.288 68.736 353.632 62.08 344.928 62.08C280.928 62.08 232.288 43.648 191.84 4.224C185.696 -1.408 176.48 -1.408 170.336 4.224C129.888 43.648 81.2479 62.08 17.2479 62.08C8.54393 62.08 1.88793 68.736 1.88793 77.44C1.88793 88.192 1.88793 98.944 1.37593 110.208C-0.672072 217.728 -3.74408 365.184 175.968 427.136L181.088 428.16L186.208 427.136C365.408 365.184 362.848 218.24 360.8 110.208ZM168.8 259.2C165.728 261.76 162.144 263.296 158.048 263.296H157.536C153.44 263.296 149.344 261.248 146.784 258.176L99.1679 205.44L122.208 184.96L159.584 226.432L242.528 147.584L263.52 170.112L168.8 259.2Z" />
                        </svg>
                        <div className="policy-item__inner-title">Bảo mật thông tin</div>
                        <div className="policy-item__text">Meron Farm cam kết bảo mật an toàn tuyệt đối với thông tin cá nhân của khách hàng theo chính sách bảo vệ thông tin của doanh nghiệp và các quy định của pháp luật Việt</div>
                    </div>
                </div>
                <div className="policy-item">
                    <div className="policy-item__inner">
                        <svg width={64} height={64} viewBox="0 0 512 512" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill="rgb(239, 103, 15)" d="M408.416 110.28C371.483 72.076 323.683 47.783 271.807 40.393L286.593 25.607C292.451 19.749 292.451 10.252 286.593 4.39397C280.736 -1.46303 271.238 -1.46303 265.38 4.39397L227.393 42.38C221.535 48.237 221.535 57.735 227.393 63.593L265.379 101.579C268.308 104.508 272.147 105.973 275.985 105.973C279.823 105.973 283.663 104.508 286.591 101.579C292.449 95.722 292.449 86.224 286.591 80.366L278.096 71.871C319.309 79.936 357.108 100.37 386.845 131.13C424.35 169.926 445.005 221.018 445.005 274.993C445.007 389.137 352.143 482 238 482C123.857 482 30.9929 389.137 30.9929 274.994C30.9929 231.439 44.3599 189.775 69.6499 154.507C94.4149 119.97 128.555 94.199 168.382 79.981C176.184 77.195 180.25 68.613 177.465 60.81C174.68 53.008 166.096 48.942 158.294 51.727C112.691 68.008 73.6079 97.504 45.2689 137.025C16.3029 177.421 0.99292 225.13 0.99292 274.995C0.99292 338.302 25.6459 397.819 70.4109 442.584C115.176 487.346 174.693 512 238 512C301.307 512 360.824 487.347 405.589 442.583C450.354 397.818 475.007 338.301 475.007 274.994C475.007 213.196 451.357 154.699 408.416 110.28Z" />
                            <path fill="rgb(239, 103, 15)" d="M83.884 274.994C83.884 359.973 153.02 429.109 238 429.109C322.979 429.109 392.115 359.973 392.115 274.994C392.115 190.015 322.979 120.877 238 120.877C153.019 120.877 83.884 190.014 83.884 274.994ZM247.208 288.345C225.616 280.712 213.106 274.696 204.03 267.577C192.86 258.816 187.747 243.685 190.685 228.09C193.873 211.172 205.671 197.704 221.476 192.943C221.695 192.877 221.91 192.824 222.128 192.76V186.72C222.128 178.436 228.844 171.72 237.128 171.72C245.412 171.72 252.128 178.436 252.128 186.72V191.805C262.601 194.258 269.911 199.045 272.866 201.254C279.501 206.215 280.859 215.614 275.899 222.25C270.938 228.886 261.541 230.242 254.903 225.283C251.727 222.909 242.961 217.801 230.129 221.667C222.548 223.951 220.587 231.412 220.166 233.645C219.335 238.055 220.29 242.206 222.543 243.972C230.39 250.125 244.468 255.558 257.205 260.06C280.505 268.296 293.461 289.881 289.445 313.77C287.473 325.499 281.573 336.382 272.829 344.416C266.816 349.94 259.809 353.868 252.128 356.084V363.266C252.128 371.55 245.412 378.266 237.128 378.266C228.844 378.266 222.128 371.55 222.128 363.266V357.559C212.149 356.386 203.822 353.313 192.623 345.987C185.69 341.452 183.747 332.155 188.282 325.222C192.817 318.288 202.115 316.346 209.047 320.881C219.43 327.674 223.356 328.298 237.028 328.203C250.489 328.113 258.299 318.08 259.86 308.796C260.624 304.262 260.917 293.191 247.208 288.345Z" />
                        </svg>
                        <div className="policy-item__inner-title">Chính sách đổi trả và hoàn tiền</div>
                        <div className="policy-item__text">Người mua và Người bán liên hệ và trao đổi thông tin để bàn thảo về việc đổi trả hàng. Meron Farm yêu cầu người bán nêu rõ chính sách đổi trả hàng (hoặc không cho phé</div>
                    </div>
                </div>
                <div className="policy-item">
                    <div className="policy-item__inner">
                        <svg width={64} height={64} viewBox="0 0 32 32" fill="rgb(239, 103, 15)" xmlns="http://www.w3.org/2000/svg">
                            <g id="Layer_2" data-name="Layer 2">
                                <path d="m16 1a15 15 0 1 0 15 15 15 15 0 0 0 -15-15zm1 20.76v1.13a1 1 0 0 1 -2 0v-1.12a3.5 3.5 0 0 1 -2.23-2 1 1 0 0 1 .93-1.34 1 1 0 0 1 .94.59 1.45 1.45 0 0 0 1.36.92 1.47 1.47 0 0 0 1.48-1.47 1.5 1.5 0 0 0 -1.48-1.54 3.54 3.54 0 0 1 -3.15-5.06 3.27 3.27 0 0 1 2.15-1.8v-1.15a1 1 0 0 1 2 0v1.18a3.48 3.48 0 0 1 1.45.84 3.59 3.59 0 0 1 .79 1.19 1 1 0 0 1 -.92 1.28 1 1 0 0 1 -.95-.57 1.71 1.71 0 0 0 -.33-.48 1.5 1.5 0 0 0 -1-.43 1.49 1.49 0 0 0 -1.47 1.48 1.53 1.53 0 0 0 1.42 1.52 3.65 3.65 0 0 1 3.51 3 3.5 3.5 0 0 1 -2.5 3.83z" />
                            </g>
                        </svg>
                        <div className="policy-item__inner-title">Hình thức thanh toán</div>
                        <div className="policy-item__text">Khách hàng có thể lựa chọn các phương thức thanh toán trên Meron Farm bao gồm: Thanh toán khi nhận hàng và Thanh toán thông qua tài khoản ngân hàng.</div>
                    </div>
                </div>
                <div className="policy-item">
                    <div className="policy-item__inner">
                        <svg width={64} height={64} viewBox="0 -104 512 512" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill="rgb(239, 103, 15)" d="m365 3.015625c44.390625 10.300781 61.371094 36.257813 82.660156 71.984375h-82.660156zm-259.421875 74.984375c8.691406 0 15 4.195312 15 14 0 8.269531-6.691406 14.976562-14.957031 15h-90.621094c-8.285156 0-15 6.71875-15 15 0 8.285156 6.714844 15 15 15h135c8.363281 0 15.058594 6.710938 15.058594 15 0 8.285156-6.714844 15-15 15h-135.058594c-8.285156 0-15 6.714844-15 15s6.714844 15 15 15h33v45c0 8.285156 6.714844 15 15 15h30.152344c5.375 26.476562 28.769531 46 56.347656 46s50.972656-19.523438 56.347656-46h152.304688c5.375 26.476562 28.769531 46 56.347656 46s50.972656-19.523438 56.347656-46h26.152344c8.285156 0 15-6.714844 15-15v-90c0-44.011719-46.421875-46.933594-46.464844-47h-115.535156c-8.285156 0-15-6.714844-15-15v-90h-272c-8.285156 0-15 6.714844-15 15v33h-18c-8.285156 0-15 6.714844-15 15s6.714844 15 15 15zm328.367187 148.054688c10.738282 10.738281 10.738282 28.15625 0 38.894531-17.273437 17.273437-46.945312 4.984375-46.945312-19.449219 0-24.429688 29.671875-36.71875 46.945312-19.445312zm-265 0c10.738282 10.738281 10.738282 28.15625 0 38.894531-17.273437 17.273437-46.945312 4.984375-46.945312-19.449219 0-24.429688 29.671875-36.71875 46.945312-19.445312zm0 0" />
                        </svg>
                        <div className="policy-item__inner-title">Vận chuyển và giao nhận</div>
                        <div className="policy-item__text">Sau khi nhận được đơn hàng từ Người mua, Meron Farm sẽ chuyển thông tin đơn hàng đó đến Người bán và xác nhận hình thức giao hàng: Người mua nhận tại cửa hàn</div>
                    </div>
                </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
};

export default Policy;
